In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
bank = pd.read_csv('mapped_imputed_simulated_transaction_2024.csv')

#print bank dimensions
print(bank.shape)

# remove columns = ['Unamed:0']
bank = bank.drop(['Unnamed: 0'], axis=1)

bank.head()

(230126, 10)

,Account No,Balance,Amount,Third Party Account No,Third Party Name,DateTime,Date,Timestamp,group
0,678330503.0,2971.0,1584.0,NaN,Westport Care Home,2023-01-01 00:00:00,2023-01-01,00:00:00,OTHER
1,472213568.0,3792.0,1950.0,NaN,Barbiee Boutique,2023-01-01 00:00:00,2023-01-01,00:00:00,Kids Store
2,472213568.0,3012.0,-780.0,283027736.0,NaN,2023-01-01 00:00:00,2023-01-01,00:00:00,NaN
3,283027736.0,1787.0,780.0,472213568.0,NaN,2023-01-01 00:00:00,2023-01-01,00:00:00,NaN
4,624500124.0,3226.0,1825.0,NaN,Fat Face,2023-01-01 00:00:00,2023-01-01,00:00:00,Outdoor Clothing Store

### Salary Estimation from company inflows